In [1]:
import pandas as pd
import numpy as np
import os

In [3]:
data_path = os.path.join('../data/kaggle-handwriting-recognition/')
train_image_path = os.path.join('../data/kaggle-handwriting-recognition/train_v2/train/')
val_image_path = os.path.join('../data/kaggle-handwriting-recognition/validation_v2/validation/')
test_image_path = os.path.join('../data/kaggle-handwriting-recognition/test_v2/test/')

In [5]:
train_data = pd.read_csv(os.path.join(data_path, 'written_name_train_v2.csv'))
val_data = pd.read_csv(os.path.join(data_path, 'written_name_validation_v2.csv'))
test_data = pd.read_csv(os.path.join(data_path, 'written_name_test_v2.csv'))

In [6]:
train_data.head()

          FILENAME   IDENTITY
0  TRAIN_00001.jpg  BALTHAZAR
1  TRAIN_00002.jpg      SIMON
2  TRAIN_00003.jpg      BENES
3  TRAIN_00004.jpg    LA LOVE
4  TRAIN_00005.jpg     DAPHNE

In [7]:
val_data.head()

              FILENAME    IDENTITY
0  VALIDATION_0001.jpg       BILEL
1  VALIDATION_0002.jpg  LAUMIONIER
2  VALIDATION_0003.jpg         LEA
3  VALIDATION_0004.jpg   JEAN-ROCH
4  VALIDATION_0005.jpg        RUPP

In [8]:
test_data.head()

        FILENAME  IDENTITY
0  TEST_0001.jpg     KEVIN
1  TEST_0002.jpg  CLOTAIRE
2  TEST_0003.jpg      LENA
3  TEST_0004.jpg     JULES
4  TEST_0005.jpg   CHERPIN

In [9]:
# It looks like there are null identities in train, val and test data
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330961 entries, 0 to 330960
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   FILENAME  330961 non-null  object
 1   IDENTITY  330396 non-null  object
dtypes: object(2)
memory usage: 5.1+ MB

In [10]:
val_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41370 entries, 0 to 41369
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FILENAME  41370 non-null  object
 1   IDENTITY  41292 non-null  object
dtypes: object(2)
memory usage: 646.5+ KB

In [11]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41370 entries, 0 to 41369
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FILENAME  41370 non-null  object
 1   IDENTITY  41300 non-null  object
dtypes: object(2)
memory usage: 646.5+ KB

In [14]:
# checking null identities
train_data[train_data['IDENTITY'].isnull()]

                FILENAME IDENTITY
1913     TRAIN_01914.jpg      NaN
2129     TRAIN_02130.jpg      NaN
2624     TRAIN_02625.jpg      NaN
4628     TRAIN_04629.jpg      NaN
4872     TRAIN_04873.jpg      NaN
...                  ...      ...
328491  TRAIN_328492.jpg      NaN
328653  TRAIN_328654.jpg      NaN
329959  TRAIN_329960.jpg      NaN
330160  TRAIN_330161.jpg      NaN
330164  TRAIN_330165.jpg      NaN

[565 rows x 2 columns]

In [15]:
# Lets remove all the rows having null identities
train_df = train_data.dropna()
val_df = val_data.dropna()
test_df = test_data.dropna()

In [16]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 330396 entries, 0 to 330960
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   FILENAME  330396 non-null  object
 1   IDENTITY  330396 non-null  object
dtypes: object(2)
memory usage: 7.6+ MB

In [18]:
val_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41292 entries, 0 to 41369
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FILENAME  41292 non-null  object
 1   IDENTITY  41292 non-null  object
dtypes: object(2)
memory usage: 967.8+ KB

In [20]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41300 entries, 0 to 41369
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FILENAME  41300 non-null  object
 1   IDENTITY  41300 non-null  object
dtypes: object(2)
memory usage: 968.0+ KB

In [22]:
# saving the updated dataframes
train_df.to_csv(os.path.join(data_path, 'train_new.csv'), index=False)
val_df.to_csv(os.path.join(data_path, 'val_new.csv'), index=False)
test_df.to_csv(os.path.join(data_path, 'test_new.csv'), index=False)